<script setup lang="ts">

</script>

<template>
    <div class="container">
        <div class="banner">
            <p id="text">Создайте впечатляющий <br>
                    сайт на Tilda <b>для бизнеса и медиа</b></p>
            <p><b>550+ профессиональных блоков готовы для вашего сайта и интернет-магазина</b></p> <br>
            <button>Тарифы</button>
        </div>
        <div class="happy">
            <h3>Как сделать тысячи людей счастливыми?</h3>
            <p><b>Мы придумали новый способ создания сайтов, где процесс похож на игру. Теперь <br>
                каждый — дизайнер, если есть страсть к любимому делу. Неважно, что вы делаете: сайт <br>
                для бизнеса, лендинг пейдж, интернет-магазин или редакторский спецпроект — <br>
                с Тильдой вы сделаете это быстро и легко.</b></p>
        </div>
        <div class="designer">
            <img src="../assets/img/image 2.png">
            <div class="oo">
                <h3>Интуитивный конструктор <br>сайтов</h3>
                <p><b>Создание сайта самостоятельно с помощью блоков <br>
                    из библиотеки Tilda. <br> <br>

                    Используйте блоки в сотнях комбинаций, просто добавляя один <br>
                    за другим, в интуитивно понятном интерфейсе. Вы сможете <span>создать <br> сайт своими
                        руками</span>.</b></p>
            </div>
        </div>
        <div class="library">
            <div>
                <h3>Библиотека блоков</h3>
                <p><b>Полноэкранные обложки, эффектная типографика,<br> фотогалереи, фоновые видео, формы заявок и многое <br>
                    другое. <br><br> Вам не обязательно быть дизайнером. Создано более 550 блоков. <br> Каждый из них гармоничен, и в
                    то же время имеет настройки, <br> позволяющие создать сайт с индивидуальным дизайном.</b></p>
            </div>
            <img src="../assets/img/image 3.png">
        </div>
       
    </div>
     <footer>
            <p>© Tilda Publishing. Этот сайт сделан также на Тильде. Написать нам: <span>team@tilda.cc</span></p>
        </footer>
</template>