<script>
export default {
    data() {
        return {
            rates: [
                {
                    name: 'Free',
                    count: '1 сайт',
                    description: 'Используй свою суперсилу с нашей коллекцией ключевых блоков',
                    price: 'Бесплатно'
                },
                {
                    name: 'Personal',
                    count: '1 сайт',
                    description: 'Полная коллекция блоков, подключение своего домена и многое другое. Полный список функций.',
                    price: '750 ₽/месяц'
                },
                {
                    name: 'Business',
                    count: '5 сайтов',
                    description: '+ Экспорт исходного кода',
                    price: '1250 ₽/месяц'
                }
            ],
            questions: [
                {
                    name: '1.В чем отличие тарифных планов Personal и Business?',
                    title: 'Тарифный план Business включает в себя все то, что есть в плане Personal, плюс позволяет экспортировать код сайтов и создавать до 5 сайтов внутри одного аккаунта (Personal — 1 сайт).'
                },
                {
                    name: '2.Можно ли привязать свой домен к сайту, сделанному на Тильде?',
                    title: 'Да. Вы можете использовать свой домен и настроить его привязку к проекту, который сделан на Тильде. Прочитайте инструкцию, как это сделать.'
                },
                {
                    name: '3.Подскажите, что понимается под «Экспорт исходного кода» в тарифе Business?',
                    title: 'Экспортируется статичный html плюс все необходимые файлы (картинки, css, js). Сайт пакуется в архив и вам дается ссылка на его скачивание. Просто разархивируйте файлы и скопируйте их к себе на сервер. Вы получите сайт, который будет открываться с вашего сервера и не будет зависим от Тильды. Прочитайте инструкцию, как это сделать.'
                },
                {
                    name: '4.Что будет если я не продлю подписку?',
                    title: 'Сайт будет снят с публикации. Данные будут храниться на Тильде в течение 6 месяцев. В любое время вы можете продлить подписку и продолжить вносить изменения в ваш проект. Если по истечении этого срока вы не продлите подписку, данные будут удалены.'
                },
                {
                    name: '5.Чем отличается сайт от страницы?',
                    title: 'Сайт может состоять из нескольких страниц (сайт-портфолио, журнал, блог) или из одной страницы (лэндинг пейдж, лонгрид). Разница в настройках: стиль (шрифты, цвета) назначается сайту, к нему же подключается домен.Таким образом, если вы делаете несколько лэндингов или интерактивных статей (лонгридов), выдержанных в едином стиле (шрифты, цвета) и размещенных на одном домене, то вам будет достаточно одного сайта. Если же вы хотите сделать несколько независимых страниц с разными стилями, подключенные к разным доменам (например, посадочные страницы для разных клиентов), то вам понадобятся несколько сайтов.'
                },
                {
                    name: '6.Будет ли сайт, сделанный на Тильде, хорошо индексироваться поисковиками?',
                    title: 'Сайты, сделанные на Тильде, по умолчанию отлично индексируются поисковиками за счет особенностей самой платформы: последовательное расположение блоков на странице. Кроме того, вы можете улучшить результаты выдачи в поисковых системах с помощью специальных настроек. Подробнее читайте в нашем Справочном центре.'
                },
                {
                    name: '7.Что такое white label?',
                    title: 'При оплате тарифа Personal или Business на год, в настройках сайта появляется дополнительная опция отключения лейбла "Made on Tilda", который по умолчанию установлен на всех страницах.'
                },
                {
                    name: '8.Есть ли у вас специальные условия для некоммерческих организаций?',
                    title: 'Да, мы стараемся поддерживать социальные и некоммерческие проекты. Узнать подробнее можно на сайте.'
                },
            ],

        }
    }
}
</script>

<template>
    <div class="container">
        <div class="hh">
            <h3>Тарифы: план для каждого</h3>
        </div>
        <div class="variants">
            <div class="var" v-for="value in rates">
                <img src="../assets/img/Снимок экрана 2024-10-28 144258.png" alt="">
                <p id="aa">{{ value.name }}</p>
                <p id="aaa">{{ value.count }}</p>
                <p>{{ value.description }}</p>
                <span>{{ value.price }}</span> <br>
                <button>Создать сайт</button>
            </div>

        </div>
        <div class="textvar" v-for="value in questions">
            <p> {{ value.name }}</p>
            <p><b> {{ value.title }}</b></p>
            <br>

        </div>
    </div>
    <footer>
        <p>© Tilda Publishing. Этот сайт сделан также на Тильде. Написать нам: <span>team@tilda.cc</span></p>
    </footer>
</template>
